<?php 
    session_start();

    if (!isset($_SESSION['username'])) {
        $_SESSION['msg'] = "You must log in first";
        header('location: login.php');
    }

    if (isset($_GET['logout'])) {
        session_destroy();
        unset($_SESSION['username']);
        header('location: login.php');
    }

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Home Page</title>

    <link rel="stylesheet" href="Home page.css">

</head>
<body>
<section>
<div class="homeheader">
    <div class="homepage">
        <h2>Home Page</h2>
    </div>
    
    <!-- Add the image here -->
    
    
    <!-- notification message -->
    <?php if (isset($_SESSION['success'])) : ?>
        <div class="success">
            <h3>
                <?php 
                    echo $_SESSION['success'];
                    unset($_SESSION['success']);
                ?>
            </h3>
        </div>
    <?php endif ?>

    <!-- logged in user information -->
    <div class="menu">
    <?php if (isset($_SESSION['username'])) : ?>
        <p class="center-text"><a href="main_webboard.php" class="custom-link">ไปยังกระทู้</a></p>
        <p>Welcome <strong><?php echo $_SESSION['username']; ?></strong></p>
        <p><a href="index.php?logout='1'" style="color: red;">Logout</a></p>
    <?php endif ?>
    </div>
</div>
</section>
<section1>
    <div class="text-overlay">
        <h1>มวยไทย : มรดกทางวัฒนธรรมของคนไทยและกีฬาแห่งประชาคมโลก</h1>
        <br>
        <p>หากกล่าวถึง "มวยไทย" เชื่อว่าคนไทยต่างรู้จักกันเป็นอย่างดี เนื่องจากเป็นศิลปะการต่อสู้อันเป็นเอกลักษณ์ของชาติมาอย่างยาวนาน ตามหลักฐานทางประวัติศาสตร์ชาติไทยปรากฏศิลปะการต่อสู้ชนิดนี้ทั่วทุกภูมิภาคและมีชื่อเรียกแตกต่างกันออกไป อาทิ มวยท่เสาของภาคเหนือ มวยไชยาของภาคใต้มวยโคราชของภาคอีสาน รวมถึงมวยลพบุรีและมวยพระนครของภาคกลาง จนมีคำกล่าวว่า "หมัดหนักโคราชฉลาดลพบุรี ท่าดีไชยา ไวกว่าท่าเสา" 

ท่าของการใช้ศิลปะมวยไทยที่สำคัญ เรียกว่า "แม่ไม้มวยไทย" จัดว่าเป็นท่าพื้นฐานของการชกมวยไทย ซึ่งผู้ฝึกมวยไทยต้องเรียนรู้และต้องปฏิบัติให้ได้ก่อนขึ้นสู่สังเวียน ซึ่งบูรพาจารย์ผู้ทรงคุณวุฒิมวยไทย ได้จัดแบ่งแม่ไม้มวยไทยออกเป็น 15 ไม้ ได้แก่ สลับฟันปลา ปักษาแหวกรัง ชวาซัดหอก อิเหนาแทงกริชยอเขาพระสุเมรุ ตาเถรค้ำฝึก มอญยันหลัก ปีกลูกทอย จระเข้ฟาดหาง หักงวงไอยรา นาคาบิดหาง วิรุฬหกกลับดับชวาลา ขุนยักษ์จับลิง และหักคอเอราวัณ นอกจากนั้นยังมีท่ของการใช้ศิลปะวยไทยที่แยกย่อยออกมาจากแม่ไม้ เรียกว่า "ลูกไม้มวยไทย" ซึ่งผู้ฝึกฝนจะต้องผ่านการฝึกท่าแม่ไม้มวยไทยให้ได้เสียก่อน แบ่งออกเป็น 15 ไม้ เช่น เอราวัณเสยงา บาทาลูบพักตร์ เป็นต้น
นอกจากนี้สิ่งที่ขาดไม่ได้ของการชกมวยไทย นั่นก็คือ "การร่ายรำไหว้ครูมวยไทย" ซึ่งถือเป็นประเพณีที่สำคัญของมวยไทย เป็นพิธีการอันศักดิ์สิทธิ์ ผู้ที่จะได้รับการฝึกฝนให้เป็นนักมวยจะต้องมีการขึ้นครูเสียก่อน เปรียบเสมือนการมอบตนเองให้อยู่ภายใต้การอบรมสั่งสอนของครูบาอาจารย์ ฝากเนื้อฝากตัวกับครูต้องเคารพและเทิดทูนครู เพื่อศึกษาวิทยาการต่าง ๆ ให้เป็นนักมวยที่หาญกล้า ปัจจุบันมวยไทยได้รับการยอมรับในระดับนานาชาติ มีการจัดการแข่งขันชกมวยไทยในระดับอาชีพโดยการควบคุมของสภามวยไทยโลก (World Boxing Council Muaythai) หรือ WBC มวยไทย และจัดตั้งองค์กรที่เกี่ยวข้องกับมวยไทย เช่น สหพันธ์มวยไทยสมัครเล่นนานาชาติ (International Federation of Muaythai Associations) หรือ IFMA โดยมีแผนจะผลักดันมวยไทยเข้าสู่การแข่งขันกีฬาโอลิมปีก จากนั้นเมื่อวันที่ 25 เมษายน พ.ศ. 2557 องค์การสหประชาชาติ (United Nation) ได้ให้การยอมรับมวยไทยเป็นกีฬาแห่งประชาคมโลก ด้วยการลงนามข้อตกลงความร่วมมือกับสภามวยไทยโลกและสหพันธ์มวยไทยสมัครเล่นนานาชาติอีกด้วย</p>
    </div>
</section1>
</body>
</html>